emacs/configs/07-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9ac985f">1. Note Taking</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9ac985f" class="outline-2">
<h2 id="org9ac985f"><span class="section-number-2">1.</span> Note Taking</h2>
<div class="outline-text-2" id="text-1">
<p>
Org-mode and note-taking configuration for knowledge management.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">note-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> org-contrib)
(<span class="org-keyword">use-package</span> ob-typescript)
(<span class="org-keyword">use-package</span> ob-powershell)
(<span class="org-keyword">use-package</span> ob-http)
(<span class="org-keyword">use-package</span> ob-restclient)
(<span class="org-keyword">use-package</span> org
  <span class="org-builtin">:pin</span> org
  <span class="org-builtin">:commands</span> (org-capture org-agenda)
  <span class="org-builtin">:custom</span>
  (org-agenda-start-with-log-mode t)
  (org-catch-invisible-edits 'show)
  (org-edit-timestamp-down-means-later t)
  (org-export-coding-system 'utf-8)
  (org-latex-compiler <span class="org-string">"xelatex"</span>)
  (org-latex-pdf-process '(<span class="org-string">"latexmk -xelatex -synctex=1 -f -interaction=nonstopmode -output-directory=%o %f"</span>))
  (org-export-kill-product-buffer-when-displayed t)
  (org-fast-tag-selection-single-key 'expert)
  (org-hide-emphasis-markers t)
  (org-html-validation-link nil)
  (org-image-actual-width '(450))
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-pretty-entities nil)
  (org-startup-indented nil)
  (org-startup-with-inline-images t)
  (org-display-remote-inline-images 'download)
  (org-tags-column 80)
  (org-src-window-setup 'current-window)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">org-tempo</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-js</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-typescript</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-ruby</span>)
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"txt"</span>  . <span class="org-string">"src text"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"cc"</span>   . <span class="org-string">"src C"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"sh"</span>   . <span class="org-string">"src shell"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"zsh"</span>  . <span class="org-string">"src zsh"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"bash"</span> . <span class="org-string">"src bash"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"posh"</span> . <span class="org-string">"src powershell"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"el"</span>   . <span class="org-string">"src emacs-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"py"</span>   . <span class="org-string">"src python"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"js"</span>   . <span class="org-string">"src js"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"ts"</span>   . <span class="org-string">"src typescript"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"java"</span> . <span class="org-string">"src java"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"scm"</span>  . <span class="org-string">"src scheme"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"sql"</span>  . <span class="org-string">"src sql"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"rust"</span> . <span class="org-string">"src rust"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"rb"</span>   . <span class="org-string">"src ruby"</span>))
  (org-babel-do-load-languages
   'org-babel-load-languages
   (seq-filter
      (<span class="org-keyword">lambda</span> (pair)
        (locate-library (concat <span class="org-string">"ob-"</span> (symbol-name (car pair)))))
      '((dot        . t)
        (C          . t)
        (gnuplot    . t)
        (latex      . t)
        (python     . t)
        (js         . t)
        (typescript . t)
        (shell      . t)
        (zsh        . t)
        (bash       . t)
        (posh       . t)
        (powershell . t)
        (scheme     . t)
        (sql        . t)
        (sqlite     . t)
        (ruby       . t)
        (emacs-lisp . t)
        (http       . t)
        (restclient . t))))
  (<span class="org-keyword">defun</span> <span class="org-function-name">handle-electric-pair-inhibit</span> (c)
      (<span class="org-keyword">if</span> (char-equal c ?&lt;) t (,electric-pair-inhibit-predicate c)))
  (<span class="org-keyword">defun</span> <span class="org-function-name">handle-org-mode-hook</span>()
      (<span class="org-keyword">setq-local</span> electric-pair-inhibit-predicate #'handle-electric-pair-inhibit))
  (add-hook 'org-mode-hook #'handle-org-mode-hook)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Load org-remoteimg for remote image display
</span>  (add-to-list 'load-path (expand-file-name <span class="org-string">"elisp/settings"</span> user-emacs-directory))
  (<span class="org-keyword">require</span> '<span class="org-constant">org-remoteimg</span>))

(<span class="org-keyword">use-package</span> org-download
  <span class="org-builtin">:after</span> org
  <span class="org-builtin">:custom</span>
  (org-download-image-dir <span class="org-string">"images"</span>)
  (org-download-heading-lvl nil)
  (org-download-screenshot-method
   (<span class="org-keyword">cond</span> ((eq system-type 'darwin) <span class="org-string">"screencapture -i %s"</span>)
         ((eq system-type 'gnu/linux) <span class="org-string">"scrot -s %s"</span>)))
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable inline display of remote images
</span>  (<span class="org-keyword">setq</span> org-download-display-inline-images 'posframe))

(<span class="org-keyword">use-package</span> org-appear
  <span class="org-builtin">:hook</span>
  (org-mode . org-appear-mode)
  <span class="org-builtin">:custom</span>
  (org-appear-autoemphasis t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t)
  (org-appear-delay 0.0)
  (org-appear-trigger 'always))

(<span class="org-keyword">use-package</span> org-gcal
  <span class="org-builtin">:after</span> org
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">IMPORTANT: Set these variables in your private.el or custom-vars.el:
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-gcal-client-id "your-client-id-from-google-console.apps.googleusercontent.com")
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-gcal-client-secret "your-client-secret-from-google-console")
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-gcal-file-alist '(("your-email@gmail.com" . "~/org/gcal.org")
</span>  <span class="org-comment-delimiter">;;                              </span><span class="org-comment">("another-calendar@gmail.com" . "~/org/work-gcal.org")))
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Directory to store OAuth token and sync metadata
</span>  (org-gcal-dir (expand-file-name <span class="org-string">".org-gcal/"</span> user-emacs-directory))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Token storage - use plain text file (no .gpg extension) to avoid encryption
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">The token file will have restricted file permissions (600) for security
</span>  (org-gcal-token-file (expand-file-name <span class="org-string">".org-gcal/token"</span> user-emacs-directory))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Automatically fetch events when opening org-agenda
</span>  (org-gcal-auto-archive nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Notify on sync
</span>  (org-gcal-notify-p t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Update events if they already exist (bidirectional sync)
</span>  (org-gcal-update-cancelled-events-with-todo t)

  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">CRITICAL: Disable plstore encryption BEFORE org-gcal loads
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">This must be in :init, not :config
</span>  (<span class="org-keyword">setq</span> plstore-cache-passphrase-for-symmetric-encryption t)
  (<span class="org-keyword">setq</span> plstore-encrypt-to nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Ensure EPG context doesn't prompt for passphrase
</span>  (<span class="org-keyword">setq</span> epg-pinentry-mode 'loopback)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-provide a passphrase if encryption can't be disabled
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">This prevents repeated prompts
</span>  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my/org-gcal-passphrase</span> <span class="org-string">"emacs-gcal-token"</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/org-gcal-passphrase-callback</span> (context key-id handback)
    <span class="org-doc">"Automatically provide passphrase for org-gcal token encryption."</span>
    my/org-gcal-passphrase)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Override EPG passphrase callback
</span>  (<span class="org-keyword">setq</span> epg-passphrase-callback-function #'my/org-gcal-passphrase-callback)

  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Additional workaround: advice plstore to disable encryption
</span>  (<span class="org-keyword">when</span> (fboundp 'plstore-open)
    (advice-add 'plstore-open <span class="org-builtin">:around</span>
                (<span class="org-keyword">lambda</span> (orig-fun file)
                  (<span class="org-keyword">let</span> ((plstore-encrypt-to nil))
                    (funcall orig-fun file)))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add org-gcal files to org-agenda-files if configured
</span>  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (boundp 'org-gcal-file-alist) org-gcal-file-alist)
    (<span class="org-keyword">dolist</span> (calendar org-gcal-file-alist)
      (<span class="org-keyword">let</span> ((gcal-file (cdr calendar)))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Create the file if it doesn't exist
</span>        (<span class="org-keyword">unless</span> (file-exists-p gcal-file)
          (make-directory (file-name-directory gcal-file) t)
          (write-region <span class="org-string">""</span> nil gcal-file))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Add to org-agenda-files if not already there
</span>        (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (boundp 'org-agenda-files)
                   (not (member gcal-file org-agenda-files)))
          (add-to-list 'org-agenda-files gcal-file)))))

  <span class="org-builtin">:bind</span>
  ((<span class="org-string">"C-c g p"</span> . org-gcal-post-at-point)
   (<span class="org-string">"C-c g d"</span> . org-gcal-delete-at-point)
   (<span class="org-string">"C-c g r"</span> . org-gcal-refresh-token)))

(<span class="org-keyword">use-package</span> denote
  <span class="org-builtin">:custom</span>
  (denote-sort-keywords t)
  (denote-directory (expand-file-name org-directory))
  (denote-prompts '(file-type subdirectory title keywords))
  <span class="org-builtin">:hook</span>
  (dired-mode . denote-dired-mode))

(<span class="org-keyword">provide</span> '<span class="org-constant">note-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">note-conf.el ends here</span>
</pre>
</div>

<p>
Reference ideas: <a href="https://emacselements.com/pdf-tools-settings.html">EmacsElements</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">pdf-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(pdf-tools-install)
(<span class="org-keyword">use-package</span> saveplace-pdf-view)
(global-goto-address-mode t)
(<span class="org-keyword">provide</span> '<span class="org-constant">pdf-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">pdf-conf.el ends here</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">org-remoteimg.el --- Display remote inline images in org-mode -*- lexical-binding: t -*-
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Copyright (C) 2023 Dean Gao - MIT License
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Author: Dean Gao <a href="mailto:gao.dean%40hotmail.com">&lt;gao.dean@hotmail.com&gt;</a>
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Description: Inline display of remote images in org-mode
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Homepage: https://github.com/gaoDean/org-imgtog
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Package-Requires: ((emacs "25.1"))
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Permission is hereby granted, free of charge, to any person obtaining a copy
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">of this software and associated documentation files (the "Software"), to deal
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">in the Software without restriction, including without limitation the rights
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">copies of the Software, and to permit persons to whom the Software is
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">furnished to do so, subject to the following conditions:
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">The above copyright notice and this permission notice shall be included in all
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">copies or substantial portions of the Software.
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">SOFTWARE.
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This package displays remote images inline in org-mode with automatic caching.
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">This means you can do \[\[https://my-file.png\]\], and have it display inline.
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">The next time you visit the file or fetch the image, it will be instantly
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">fetched from the cache.
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">org-element</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">url</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">url-cache</span>)

(<span class="org-keyword">unless</span> (fboundp 'image-supported-file-p)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">`</span><span class="org-comment"><span class="org-constant">image-supported-file-p</span></span><span class="org-comment">' isn't available before Emacs 28
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add alias to not break Emacs &lt;28.
</span>  (<span class="org-keyword">defalias</span> '<span class="org-function-name">image-type-from-file-name</span> 'image-supported-file-p))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Compatibility definitions for Org-mode &lt; 9.8
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">In Org &lt; 9.8, the variable is called org-inline-image-overlays
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">In Org &gt;= 9.8, it was renamed to org-link-preview-overlays
</span>(<span class="org-keyword">unless</span> (boundp 'org-link-preview-overlays)
  (<span class="org-keyword">defvaralias</span> '<span class="org-variable-name">org-link-preview-overlays</span> 'org-inline-image-overlays
    <span class="org-doc">"Compatibility alias for org-inline-image-overlays in Org &lt; 9.8."</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-image-update-overlay</span> (file link <span class="org-type">&amp;optional</span> data-p refresh)
  <span class="org-doc">"Create image overlay for FILE associtated with org-element LINK.
If DATA-P is non-nil FILE is not a file name but a string with the image data.
If REFRESH is non-nil don't download the file but refresh the image.
See also `</span><span class="org-doc"><span class="org-constant">create-image</span></span><span class="org-doc">'.
This function is almost a duplicate of a part of `</span><span class="org-doc"><span class="org-constant">org-display-inline-images</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">or</span> data-p (file-exists-p file))
    (<span class="org-keyword">let</span> ((width
           <span class="org-comment-delimiter">;; </span><span class="org-comment">Apply `</span><span class="org-comment"><span class="org-constant">org-image-actual-width</span></span><span class="org-comment">' specifications.
</span>           (<span class="org-keyword">cond</span>
            ((eq org-image-actual-width t) nil)
            ((listp org-image-actual-width)
             (<span class="org-keyword">or</span>
              <span class="org-comment-delimiter">;; </span><span class="org-comment">First try to find a width among
</span>              <span class="org-comment-delimiter">;; </span><span class="org-comment">attributes associated to the paragraph
</span>              <span class="org-comment-delimiter">;; </span><span class="org-comment">containing link.
</span>              (<span class="org-keyword">let</span> ((paragraph
                     (<span class="org-keyword">let</span> ((e link))
                       (<span class="org-keyword">while</span> (<span class="org-keyword">and</span> (<span class="org-keyword">setq</span> e (org-element-property
                                            <span class="org-builtin">:parent</span> e))
                                   (not (eq (org-element-type e)
                                            'paragraph))))
                       e)))
                (<span class="org-keyword">when</span> paragraph
                  (<span class="org-keyword">save-excursion</span>
                    (goto-char (org-element-property <span class="org-builtin">:begin</span> paragraph))
                    (<span class="org-keyword">when</span>
                        (re-search-forward
                         <span class="org-string">"^[ \t]*#\\+attr_.*?: +.*?:width +</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\S-+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span>
                         (org-element-property
                          <span class="org-builtin">:post-affiliated</span> paragraph)
                         t)
                      (string-to-number (match-string 1))))))
              <span class="org-comment-delimiter">;; </span><span class="org-comment">Otherwise, fall-back to provided number.
</span>              (car org-image-actual-width)))
            ((numberp org-image-actual-width)
             org-image-actual-width)))
          (old (get-char-property-and-overlay
                (org-element-property <span class="org-builtin">:begin</span> link)
                'org-image-overlay)))
      (<span class="org-keyword">if</span> (<span class="org-keyword">and</span> (car-safe old) refresh)
          (image-flush (overlay-get (cdr old) 'display))
        (<span class="org-keyword">let</span> ((image (create-image file
                                   (<span class="org-keyword">and</span> (image-type-available-p 'imagemagick)
                                        width
                                        'imagemagick)
                                   data-p
                                   <span class="org-builtin">:width</span> width)))
          (<span class="org-keyword">when</span> image
            (<span class="org-keyword">let*</span> ((link
                    <span class="org-comment-delimiter">;; </span><span class="org-comment">If inline image is the description
</span>                    <span class="org-comment-delimiter">;; </span><span class="org-comment">of another link, be sure to
</span>                    <span class="org-comment-delimiter">;; </span><span class="org-comment">consider the latter as the one to
</span>                    <span class="org-comment-delimiter">;; </span><span class="org-comment">apply the overlay on.
</span>                    (<span class="org-keyword">let</span> ((parent
                           (org-element-property <span class="org-builtin">:parent</span> link)))
                      (<span class="org-keyword">if</span> (eq (org-element-type parent) 'link)
                          parent
                        link)))
                   (ov (make-overlay
                        (org-element-property <span class="org-builtin">:begin</span> link)
                        (<span class="org-keyword">progn</span>
                          (goto-char
                           (org-element-property <span class="org-builtin">:end</span> link))
                          (skip-chars-backward <span class="org-string">" \t"</span>)
                          (point)))))
              (overlay-put ov 'display image)
              (overlay-put ov 'face 'default)
              (overlay-put ov 'org-image-overlay t)
              (overlay-put
               ov 'modification-hooks
               (list 'org-display-inline-remove-overlay))
              (<span class="org-keyword">push</span> ov org-link-preview-overlays)
              ov)))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-display-user-inline-images</span> (<span class="org-type">&amp;optional</span> _include-linked _refresh beg end)
  <span class="org-doc">"Like `</span><span class="org-doc"><span class="org-constant">org-display-inline-images</span></span><span class="org-doc">' but for image data links.
_INCLUDE-LINKED and _REFRESH are ignored.
Restrict to region between BEG and END if both are non-nil.
Image data links have a :image-data-fun parameter.
\(See `</span><span class="org-doc"><span class="org-constant">org-link-set-parameters</span></span><span class="org-doc">'.)
The value of the :image-data-fun parameter is a function
taking the PROTOCOL, the LINK, and the DESCRIPTION as arguments.
If that function returns nil the link is not interpreted as image.
Otherwise the return value is the image data string to be displayed.

Note that only bracket links are allowed as image data links
with one of the formats
 [[PROTOCOL:LINK]]
or
 [[PROTOCOL:LINK][DESCRIPTION]]
are recognized.
Full credit goes to org-yt by Tobias Zawada for this function."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (called-interactively-p 'any)
             (use-region-p))
    (<span class="org-keyword">setq</span> beg (region-beginning)
          end (region-end)))
  (<span class="org-keyword">when</span> (display-graphic-p)
    (<span class="org-keyword">org-with-wide-buffer</span>
     (goto-char (<span class="org-keyword">or</span> beg (point-min)))
     (<span class="org-keyword">when-let*</span> ((image-data-link-parameters
               (<span class="org-keyword">cl-loop</span> for link-par-entry in org-link-parameters
                        with fun
                        when (<span class="org-keyword">setq</span> fun (plist-get (cdr link-par-entry) <span class="org-builtin">:image-data-fun</span>))
                        collect (cons (car link-par-entry) fun)))
              (image-data-link-re (regexp-opt (mapcar 'car image-data-link-parameters)))
              (re (format <span class="org-string">"\\[\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">:</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">]]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(?:</span></span><span class="org-string">\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">]]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">?\\]"</span>
                          image-data-link-re)))
       (<span class="org-keyword">while</span> (re-search-forward re end t)
         (<span class="org-keyword">let*</span> ((protocol (match-string-no-properties 1))
              (link (match-string-no-properties 2))
              (description (match-string-no-properties 3))
              (image-data-link (assoc-string protocol image-data-link-parameters))
              (el (<span class="org-keyword">save-excursion</span> (goto-char (match-beginning 1)) (org-element-context)))
              image-data)
           (<span class="org-keyword">when</span> el
             (<span class="org-keyword">setq</span> image-data
                   (<span class="org-keyword">or</span> (<span class="org-keyword">let</span> ((old (get-char-property-and-overlay
                                   (org-element-property <span class="org-builtin">:begin</span> el)
                                   'org-image-overlay)))
                         (<span class="org-keyword">and</span> old
                              (car-safe old)
                              (overlay-get (cdr old) 'display)))
                     (funcall (cdr image-data-link) protocol link description)))
             (<span class="org-keyword">when</span> image-data
               (<span class="org-keyword">let</span> ((ol (org-image-update-overlay image-data el t t)))
                 (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> ol description)
                   (overlay-put ol 'after-string description)))))))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-remoteimg--fetch-image</span> (protocol link _description)
  <span class="org-doc">"Synchronously retrieve image from cache or web."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (image-supported-file-p link)
             (not (eq org-display-remote-inline-images 'skip)))
    (<span class="org-keyword">let*</span> ((cache (eq org-display-remote-inline-images 'cache))
           (url-automatic-caching (<span class="org-keyword">if</span> cache
                                      t
                                    url-automatic-caching))
           (url (concat protocol <span class="org-string">":"</span> link))
           (silent-output (file-exists-p (url-cache-create-filename url))))
      (<span class="org-keyword">if-let*</span> ((buf (url-retrieve-synchronously url
                                                   silent-output
                                                   nil
                                                   30)))
              (<span class="org-keyword">with-current-buffer</span> buf
                (goto-char (point-min))
                (re-search-forward <span class="org-string">"\r?\n\r?\n"</span> nil t)
                (buffer-substring-no-properties (point) (point-max)))
            (<span class="org-warning">error</span> <span class="org-string">"Download of image \"%s\" failed"</span> link)
            nil))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-link-preview-http</span> (ov _path link)
  <span class="org-doc">"Generate preview OV for LINK in PATH."</span>
  (<span class="org-keyword">when-let*</span> ((raw-link (org-element-property <span class="org-builtin">:raw-link</span> link))
              (image-type (image-supported-file-p raw-link))
              <span class="org-comment-delimiter">;; </span><span class="org-comment">cache?
</span>              (image-buffer (org-remoteimg--fetch-image nil raw-link nil)))
        (overlay-put ov 'display (create-image image-buffer
                                      <span class="org-comment-delimiter">;; </span><span class="org-comment">scale?
</span>                                   <span class="org-comment-delimiter">;; </span><span class="org-comment">(and (image-type-available-p 'imagemagick)
</span>                                   <span class="org-comment-delimiter">;;      </span><span class="org-comment">width
</span>                                   <span class="org-comment-delimiter">;;      </span><span class="org-comment">'imagemagick)
</span>                                                             <span class="org-comment-delimiter">;; </span><span class="org-comment">:width width
</span>                                                             image-type
                                                             t))
        t))

(<span class="org-keyword">if</span> (fboundp 'org-display-inline-images)
    (<span class="org-keyword">progn</span>
      (advice-add #'org-display-inline-images <span class="org-builtin">:after</span> #'org-display-user-inline-images)
      (org-link-set-parameters <span class="org-string">"http"</span>  <span class="org-builtin">:image-data-fun</span> #'org-remoteimg--fetch-image)
      (org-link-set-parameters <span class="org-string">"https"</span> <span class="org-builtin">:image-data-fun</span> #'org-remoteimg--fetch-image))
  (org-link-set-parameters <span class="org-string">"http"</span> <span class="org-builtin">:preview</span> #'org-link-preview-http)
  (org-link-set-parameters <span class="org-string">"https"</span> <span class="org-builtin">:preview</span> #'org-link-preview-http))

(<span class="org-keyword">provide</span> '<span class="org-constant">org-remoteimg</span>)

<span class="org-comment-delimiter">;;; </span><span class="org-comment">org-remoteimg.el ends here
</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
